{
  "name": "bepo",
  "repository": {
    "type": "git",
    "url": "https://github.com/ghivert/atom-bepo"
  },
  "downloads": 29,
  "stargazers_count": 0,
  "releases": {
    "latest": "0.1.0"
  },
  "versions": {
    "0.1.0": {
      "name": "bepo",
      "main": "./lib/atom-bepo",
      "version": "0.1.0",
      "description": "Shortcuts to work with the BÉPO keyboard easily.",
      "keywords": [],
      "activationCommands": {
        "atom-workspace": "atom-bepo:insert-quote"
      },
      "repository": "https://github.com/ghivert/atom-bepo",
      "license": "MIT",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dependencies": {},
      "dist": {
        "tarball": "https://www.atom.io/api/packages/bepo/versions/0.1.0/tarball"
      }
    }
  },
  "readme": "# Bépo package\n\nBépo est un clavier conçu pour simplifier l'écriture du français. Comme le Dvorak, il aide à écrire en dactylographie. Mais dans la dernière norme publiée par l’AFNOR, le caractère `'` est plus difficilement accessible pour les développeurs dans un usage quotidien. Heureusement, nous pouvons restaurer l’ancien comportement (amélioré en plus !) grâce à Atom !\n\n## For English speakers\n\nBépo is a keyboard built to simplify writing French in a daily base. Just like Dvorak, bépo helps to write blindly and with reduced hand movements. But in the latest standard of the AFNOR, the `'` character is now difficulty accessible for developers in an everyday use. Hopefully, we can turn this off easily, thanks to Atom!\n\n# Installation\n\n```\napm install bepo\n```\n\n# Usage\n\nÀ chaque `’` entré, le package essaiera de déterminer quel caractère il doit entrer ! Si le curseur est dans une String, l’insertion sera un `’`, à moins qu’il ne soit juste à côté d’un caractère `'`, dans ce cas il insérera un caractère `'` et fermera la String à l’aide de Bracket Matcher.\n\n# Évolutions\n\nIl est tout à fait possible d’imaginer des comportements supplémentaires : inversion complète `’` et `'`, inversion sélective, etc. Pour l’instant ce package répond à mon problème qui utilise Bracket Matcher. N’hésitez pas à me dire comment le compléter avec Issues ou Pull Requests !\n",
  "metadata": {
    "name": "bepo",
    "main": "./lib/atom-bepo",
    "version": "0.1.0",
    "description": "Shortcuts to work with the BÉPO keyboard easily.",
    "keywords": [],
    "activationCommands": {
      "atom-workspace": "atom-bepo:insert-quote"
    },
    "repository": "https://github.com/ghivert/atom-bepo",
    "license": "MIT",
    "engines": {
      "atom": ">=1.0.0 <2.0.0"
    },
    "dependencies": {}
  }
}