{
  "name": "ceed-atom",
  "repository": {
    "type": "git",
    "url": "https://github.com/CeedIO/ceed-atom"
  },
  "downloads": 12,
  "stargazers_count": 0,
  "releases": {
    "latest": "0.1.0"
  },
  "versions": {
    "0.1.0": {
      "name": "ceed-atom",
      "main": "./lib/main",
      "version": "0.1.0",
      "description": "Search for and render your Ceed scripts directly within Atom",
      "keywords": [],
      "activationCommands": {
        "atom-workspace": "ceed-atom:trigger"
      },
      "repository": "https://github.com/CeedIO/ceed-atom",
      "license": "MIT",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dependencies": {},
      "dist": {
        "tarball": "https://www.atom.io/api/packages/ceed-atom/versions/0.1.0/tarball"
      }
    }
  },
  "readme": "## Ceed-Atom\n\nEasily integrate the Ceed platform into Atom and generate source code in seconds.\n\n\n### Configuration\n\nBe sure to set your API key in the package settings.<br />\nYou can find it by going here: https://ceed.io/security/api\n\n\n### Usage\n\nTo trigger the Ceed package, type a trigger word somewhere in your code. Place the cursor\nin the middle or at the end of the word and press `CTRL-ALT-C`.\n\nDepending upon the word you supply, one of several outcomes will occur:\n\n1. If no scripts have a matching trigger word, you will receive an error.\n2. If only one script possesses the trigger word, Ceed will auto select it.\n3. If more than one script possesses the trigger word, Ceed will provide you a list (max 10 entries) to choose from.\n\nYou will then be presented with a form similar to ceed.io where you can enter any variables and supply a schema if required. When you're done, click on the execute button.\n\nCeed will attempt to render your script. If it was successful, you will be returned to the text editor and the trigger word will be replaced with your rendered source code.\n\nIf an error occurred, Ceed will inform you of the problem and indicate where in the script the error occurred. If an error occurs, you can take one of two options:\n\n1. Fix any issues with variables / schemas and perform the execution again.\n2. Visit ceed.io to modify the script / fix any issues.\n\n\n### Notes\n* Don't worry about your execution count when encountering errors, it is only incremented on a successful render.\n* Since the plugin uses the Ceed public API, it is bound by the same restrictions. Specifically, the limit of 60 requests per minute.\n* Ceed may be remapped to any keyboard shortcut. Simply point the shortcut to `ceed-atom:trigger`.",
  "metadata": {
    "name": "ceed-atom",
    "main": "./lib/main",
    "version": "0.1.0",
    "description": "Search for and render your Ceed scripts directly within Atom",
    "keywords": [],
    "activationCommands": {
      "atom-workspace": "ceed-atom:trigger"
    },
    "repository": "https://github.com/CeedIO/ceed-atom",
    "license": "MIT",
    "engines": {
      "atom": ">=1.0.0 <2.0.0"
    },
    "dependencies": {}
  }
}