{
  "name": "commentariat",
  "repository": {
    "type": "git",
    "url": "https://github.com/anthbrtn/commentariat"
  },
  "downloads": 652,
  "stargazers_count": 1,
  "releases": {
    "latest": "0.2.0"
  },
  "versions": {
    "0.2.0": {
      "name": "commentariat",
      "theme": "syntax",
      "version": "0.2.0",
      "description": "Commentariat is a dark syntax theme explicitly designed for writing papers, essays, academic articles, and others in [markdown](https://en.wikipedia.org/wiki/Markdown).",
      "keywords": [
        "syntax",
        "theme",
        "markdown",
        "academic",
        "citation",
        "bibtex",
        "footnote",
        "essay",
        "writing",
        "cite",
        "zotero",
        "comment",
        "commentariat"
      ],
      "repository": "https://github.com/anthbrtn/commentariat",
      "license": "MIT",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dist": {
        "tarball": "https://www.atom.io/api/packages/commentariat/versions/0.2.0/tarball"
      }
    },
    "0.1.0": {
      "name": "commentariat",
      "theme": "syntax",
      "version": "0.1.0",
      "description": "Commentariat is a dark syntax theme explicitly designed for writing papers, essays, academic articles, and others in [markdown](https://en.wikipedia.org/wiki/Markdown).",
      "keywords": [
        "syntax",
        "theme",
        "markdown",
        "academic",
        "citation",
        "bibtex",
        "footnote",
        "essay",
        "writing",
        "cite",
        "zotero",
        "comment",
        "commentariat"
      ],
      "repository": "https://github.com/anthbrtn/commentariat",
      "license": "MIT",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dist": {
        "tarball": "https://www.atom.io/api/packages/commentariat/versions/0.1.0/tarball"
      }
    }
  },
  "readme": "# commentariat: academic writing in markdown that lets you focus on the content\n\nCommentariat is a dark syntax theme explicitly designed for writing papers, essays, academic articles, and others in [markdown](https://en.wikipedia.org/wiki/Markdown). Despite the maturity of Atom's theming framework, there are few options available for dark themes to those interested in using Atom as an academic toolkit, and I find that writing with darker backgrounds and lighter text makes it easier to focus on the task at hand. If you want a light theme, I highly recommend [Pen-Paper-Coffee](https://atom.io/themes/pen-paper-coffee-syntax)).\nThe theme features a pastel-based color scheme for a decent amount of contrast while writing the syntactic elements of markdown. The colors are mapped to a variety of different elements for differentiation, and the end result is being able to see each independent change or addition to your own plain text writing without the contrast between each element causing a headache, obviously important to writing the types of long documents characteristic of academic writing.  \nFor an effective and seamless academic workflow writing in markdown in atom, I suggest the following extensions:\n\n  1. For making citations an _incredibly_ easier workflow, I recommend installing [autocomplete-bibtex](https://atom.io/packages/autocomplete-bibtex). I've found that other solutions for citations are not nearly as seamless (i.e. the Zotero citation picker plugins available). Having autocomplete-bibtex installed alongside the Better BiBTeX plugin for Zotero (and exporting an automatically-updating .bibtex keyfile) allows you to hit the @ symbol in any markdown file and fill in any citation very, very easily.\n  2. The other game-changer is [markdown-footnote](https://atom.io/packages/markdown-footnote). This allows you to hit a keyboard shortcut and immediately add a footnote to markdown documents. The _key_ feature that it has over other markdown footnote plugins is the keybinding to return to where you plugged in the footnote back in the document---making for a seamless workflow when it comes to footnotes and citations together with autocomplete-bibtex.\n  3. [Zen](https://atom.io/packages/Zen) for distraction-free writing. It blows the current writing window up to full screen, letting you dive in to whatever piece requires your focused attention.\n  4. [Advanced Open File](https://atom.io/packages/advanced-open-file) is much more effective than atom's built-in file browsing utilities, and allows you to consult lists of notes or open outline documents that will help you with your writing.\n  5. If you want to _really_ superpower your academic project frameworks, I recommend installing [project-manager](https://atom.io/packages/project-manager).\n  6. [Markdown-table-editor](https://atom.io/packages/markdown-table-editor) makes the addition of tables easy. No more searching for 'csv to markdown converter' every time you have a csv that you need to convert into a table.\n  7. [wordcount](https://atom.io/packages/wordcount) does what it says.\n  8. If you're feeling hardcore, linter plugins to improve your prose can be installed with [linter-write-good](https://atom.io/packages/linter-write-good) and [linter-proselint](https://atom.io/packages/linter-proselint). They both require the basic [linter framework](https://atom.io/packages/linter). My caveat with suggesting these is the prescriptivism they push you towards---while they often catch things you should never use, like passive voice, they both also throw a fit at \"weasel words\" like \"very\" or any other qualifying adjective, which can suck the voice and life out of one's own writing style if you don't take their suggestions with a grain of salt. Proselint, especially, seems to think that the sparse style of Hemingway and others like him is the only correct style, when these decisions usually come down to preference.  \n\nHere's a screenshot of the markup backend for [this post](https://dcc.infoscapelab.ca/projects/ecosystem/the-rebel-yell/)\n\n![img](./screenshots/screenshot1.png)\n\nThis syntax theme started from an edit of [monokai-solarized-dark](https://atom.io/packages/monokai-solarized-dark).\n",
  "metadata": {
    "name": "commentariat",
    "theme": "syntax",
    "version": "0.2.0",
    "description": "Commentariat is a dark syntax theme explicitly designed for writing papers, essays, academic articles, and others in [markdown](https://en.wikipedia.org/wiki/Markdown).",
    "keywords": [
      "syntax",
      "theme",
      "markdown",
      "academic",
      "citation",
      "bibtex",
      "footnote",
      "essay",
      "writing",
      "cite",
      "zotero",
      "comment",
      "commentariat"
    ],
    "repository": "https://github.com/anthbrtn/commentariat",
    "license": "MIT",
    "engines": {
      "atom": ">=1.0.0 <2.0.0"
    }
  }
}