{
  "name": "hash-n",
  "repository": {
    "type": "git",
    "url": "https://github.com/rockymadden/hash-n"
  },
  "downloads": 712,
  "stargazers_count": 2,
  "releases": {
    "latest": "0.1.0"
  },
  "versions": {
    "0.1.0": {
      "name": "hash-n",
      "version": "0.1.0",
      "main": "./lib/hash-n",
      "description": "Compute hash of current buffer or selected text. Real-time value displayed in the Atom status bar.",
      "repository": "https://github.com/rockymadden/hash-n",
      "license": "MIT",
      "engines": {
        "atom": ">0.90.0"
      },
      "dist": {
        "tarball": "https://www.atom.io/api/packages/hash-n/versions/0.1.0/tarball"
      }
    }
  },
  "readme": "# hash-n\nCompute hash of current buffer or selected text. Real-time value displayed in the Atom status bar.\n\n![hash-n](http://share.rockymadden.com/8sxc+)\n\n## Tidbits\n* Clicking the status bar hash value will to copy said value to your clipboard\n* Algorithms available are system dependent, but include:  dsa, dsa-sha, dsa-sha1, dsaEncryption,\ndsaWithSHA, dsaWithSHA1, dss1, ecdsa-with-SHA1, md4, md4WithRSAEncryption, md5, md5WithRSAEncryption, mdc2, mdc2WithRSA,\nripemd, ripemd160, ripemd160WithRSA, rmd160, rsa-md4, rsa-md5, rsa-mdc2, rsa-ripemd160, rsa-sha, rsa-sha1, rsa-sha1-2,\nrsa-sha224, rsa-sha256, rsa-sha384, rsa-sha512, sha, sha1, sha1WithRSAEncryption, sha224, sha224WithRSAEncryption,\nsha256, sha256WithRSAEncryption, sha384, sha384WithRSAEncryption, sha512, sha512WithRSAEncryption,\nshaWithRSAEncryption, ssl2-md5, ssl3-md5, ssl3-sha1\n\n## License\n\n```\nThe MIT License (MIT)\n\nCopyright (c) 2014 Rocky Madden (http://rockymadden.com/)\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n```\n",
  "metadata": {
    "name": "hash-n",
    "version": "0.1.0",
    "main": "./lib/hash-n",
    "description": "Compute hash of current buffer or selected text. Real-time value displayed in the Atom status bar.",
    "repository": "https://github.com/rockymadden/hash-n",
    "license": "MIT",
    "engines": {
      "atom": ">0.90.0"
    }
  }
}