{
  "name": "high-contrast-dark-syntax",
  "repository": {
    "type": "git",
    "url": "https://github.com/rexyque/high-contrast-dark-syntax"
  },
  "downloads": 1154,
  "stargazers_count": 0,
  "releases": {
    "latest": "0.1.0"
  },
  "versions": {
    "0.1.0": {
      "name": "high-contrast-dark-syntax",
      "theme": "syntax",
      "version": "0.1.0",
      "description": "A High Contrast, fully WCAG AA compliant theme with black as the background.",
      "keywords": [
        "syntax",
        "theme"
      ],
      "repository": "https://github.com/rexyque/high-contrast-dark-syntax",
      "license": "MIT",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dist": {
        "tarball": "https://www.atom.io/api/packages/high-contrast-dark-syntax/versions/0.1.0/tarball"
      }
    }
  },
  "readme": "# high-contrast-dark-syntax theme\n\nA High Contrast, fully WCAG AA compliant theme with black as the background.\nThis theme was designed with C# in mind as I do most of my work in that language.\nIf you use a different language and the theme doesn't work well for\nthat language, feel free to submit a pull request!\n\n## WCAG\n\nThe Web Content Accessibility Guidelines (WCAG) define guidelines for the level\nof color contrast required to make text legible to individuals with visual\nimpairments, among other things. The full content of the guidelines is available\nat https://www.w3.org/TR/WCAG20/\n\nThe guidelines define two levels of color accessibility, AA and AAA. The AAA\nstandard is more demanding than the AA standard. All of the default colors used\nin this theme meet the AAA standards on a black background. They also all meet\nAAA standards against the default selected text background at large sizes (18+).\nHowever, because there is currently no way to change the color of font when it\nis selected in Atom, I had to settle for only AA compliance against the default\nselected text background at smaller fonts.\n\n## Special Thanks\n\nSpecial thanks to Donielle Berg and Adrian Rapp for developing colorsafe.co, a\ntool which made this project much, much easier. If you want to change colors,\nI'd suggest using them to find WCAG AAA compliant colors quickly.\n\nI also want to thank the Center for Persons with Disabilities at Utah State\nUniversity for creating another useful tool for quickly checking the contrast\nratio of two different colors, as well as whether the combination conforms to\nWCAG guidelines or not. That tool is available at https://webaim.org/resources/contrastchecker/\n",
  "metadata": {
    "name": "high-contrast-dark-syntax",
    "theme": "syntax",
    "version": "0.1.0",
    "description": "A High Contrast, fully WCAG AA compliant theme with black as the background.",
    "keywords": [
      "syntax",
      "theme"
    ],
    "repository": "https://github.com/rexyque/high-contrast-dark-syntax",
    "license": "MIT",
    "engines": {
      "atom": ">=1.0.0 <2.0.0"
    }
  }
}