{
  "name": "impeccable-syntax",
  "repository": {
    "type": "git",
    "url": "https://github.com/tomstil/impeccable-syntax"
  },
  "downloads": 117,
  "stargazers_count": 0,
  "releases": {
    "latest": "0.1.1"
  },
  "versions": {
    "0.1.1": {
      "name": "impeccable-syntax",
      "theme": "syntax",
      "version": "0.1.1",
      "description": "A light syntax theme with few colors.",
      "keywords": [
        "syntax",
        "theme"
      ],
      "repository": "https://github.com/tomstil/impeccable-syntax",
      "license": "ISC",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dist": {
        "tarball": "https://www.atom.io/api/packages/impeccable-syntax/versions/0.1.1/tarball"
      }
    },
    "0.1.0": {
      "name": "impeccable-syntax",
      "theme": "syntax",
      "version": "0.1.0",
      "description": "A light syntax theme with few colors.",
      "keywords": [
        "syntax",
        "theme"
      ],
      "repository": "https://github.com/tomstil/impeccable-syntax",
      "license": "ISC",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dist": {
        "tarball": "https://www.atom.io/api/packages/impeccable-syntax/versions/0.1.0/tarball"
      }
    }
  },
  "readme": "# Impeccable Syntax theme\n\nImpeccable syntax is an attempt at a less ornate syntax highlighting\ntheme that has fewer colors than what’s conventional and occasionally\nhas typographic features to differentiate pieces of code.\n\n![Screenshot of the Impeccable Syntax theme](./impeccable-syntax-screenshot.png)\n\nI recommended that a variant of the\n[Iosevka font](https://github.com/be5invis/Iosevka)\nis used with this theme as it’s the only font I’ve tested in\nconjunction with the theme. If you’d rather use a different font,\nchoose one that has regular (often equivalent to a font-weight value of\n400 in CSS), medium (often 500) and bold (often 700) weights and an\nitalic style.\n\n## Design\n\nHeavier weighted text seems to stand out better than lighter weighted\ntext. With this being the case, a bold weight was chosen for aspects\nsuch as keywords because these often begin and end sections of code.\nHopefully this will enable more effective scanning.\n\nItalics were chosen for constants and basic literals because in\ncontrast to heavier weights, italics seem to attract less attention\nwhile still providing emphasis over roman type. Color is still used as\nI found that using only italics to didn’t provide enough contrast to\nregular text.\n\nCharacters within a string that are not literally part of the string\nare in roman style, a bold weight and gray.\n\nBrackets, comments and some other things are in a bold weight and gray.\n\n## Bugs\n\n### Incomplete styling\n\nI still have work to do in regards to making sure all aspects of syntax\nhighlighting are styled how I want them. I’m not sure what all of the\nselectors effect. Consequently some things are styled with default\nstyles or have inherited styles I don’t intend for them to have.\n\n### Inconsistent styling\n\nAtom wraps pieces of text in tags based of rules in the grammar defined\nfor the current file’s type. I’m not sure if certain characters or\nsequences of characters can be styled without modifying or replacing\nthe grammar files Atom includes as these are slightly inconsistent in\nhow certain textual aspects are defined.\n\nAs an example, by default Atom treats double quotation marks (for\nstring literals) in a CSS file as punctuation whereas in a Ruby file\n(again for string literals) these characters are part of the string.\nIt’s possible to style double quotation marks separately from a string\nfor CSS files but for Ruby this doesn’t seem possible.\n\n### Incorrect styling under certain conditions\n\nIf one creates a new HTML file and selects the default HTML grammar,\nthe styling of text between quotes and the quotes themselves are not\nstyled correctly unless the file is saved and reopened.\n\n## Copyright and license\n\n© 2019 Tommy Stilwell\n\nSee the LICENSE.md file for more information.\n",
  "metadata": {
    "name": "impeccable-syntax",
    "theme": "syntax",
    "version": "0.1.1",
    "description": "A light syntax theme with few colors.",
    "keywords": [
      "syntax",
      "theme"
    ],
    "repository": "https://github.com/tomstil/impeccable-syntax",
    "license": "ISC",
    "engines": {
      "atom": ">=1.0.0 <2.0.0"
    }
  }
}