{
  "name": "language-raidelve",
  "repository": {
    "type": "git",
    "url": "https://github.com/sjbertolani/atom-language-raidelve"
  },
  "downloads": 27,
  "stargazers_count": 1,
  "releases": {
    "latest": "0.6.0"
  },
  "versions": {
    "0.6.0": {
      "name": "language-raidelve",
      "main": "./lib/language-raidelve",
      "version": "0.6.0",
      "description": "Language support for RaiDelve from RelationalAI",
      "keywords": [],
      "activationCommands": {
        "atom-workspace": "language-raidelve:toggle"
      },
      "repository": "https://github.com/sjbertolani/atom-language-raidelve",
      "license": "MIT",
      "engines": {
        "atom": ">=1.0.0 <2.0.0"
      },
      "dependencies": {
        "tree-sitter-delve-language": "0.0.1"
      },
      "dist": {
        "tarball": "https://www.atom.io/api/packages/language-raidelve/versions/0.6.0/tarball"
      }
    }
  },
  "readme": "# language-raidelve package\n\n## To install (short)\n\n``` apm install https://github.com/sjbertolani/atom-language-raidelve```\n\n___\n\n\n## To install (long)\n\n0 - In order for the apm install command to work, you must have python 2.7 in your PATH ( due to node-gyp only working with python 2 see issue - https://discuss.atom.io/t/npm-and-gyp-errors-during-apm-install/54658/4). You can check what version is available by typing ```python --version``` . If it is another version, consider modifying your path just for installing this package. You could do something like ```echo $PATH``` and remove any path that leads to another python version ( i.e. ~/anaconda3/bin ). Or you could just append ```export PATH=/usr/bin/:$PATH``` assuming you have python 2 in this directory. Alternatively, you could do something like-> ```export PYTHON=/usr/bin/python2.7``` <- although I haven't test this.\n\n1 - ``` apm install https://github.com/sjbertolani/atom-language-raidelve``` This installs the atom package in ~/.atom/packages\n\n2 - Start Atom\n\n3 - In Atom, open a file containing RaiDelve code that has the file extension \".delve\". Ideally, you will see some code now highlighted. \n\n---\n\nYou may also need to do the following things depending on your computer.\n\nA - Restart Atom after setting the stylesheet.\n\nB - You may have to set the language in Atom to recognize the file as RaiDelve code. It is supposed to autodetect if the file ends in \".delve\" but that has not always worked. See the bottom right hand corner of the Atom editor for the language setting.\n\nC - Add the contents of styles.less from this package into the global stylesheet. You can either find the menu to open \"Stylesheet\" and paste the contents there. Or you can use the command palette ( ctrl-shift-p ) and search for \"Open Your Stylesheet\". This is the global style settings for Atom. However, you should get some styling by default in Atom. This just lets you which color gets applied to which subset of tokens.\n\n\n## Debugging why the styling doesn't work\n\n### Check the parsing is working\nOpen a .delve file, set the language to raidelve. Then place your cursor in front of a keyword ( ex. and ). Then use the command palette ( ctrl-shift-p ) and search for 'Log Cursor Scope'. Select that function and you should see a popup in the editor. If the parser is working correctly, you should see \"delve \" and \"keyword.control\". If you see \"delve\" and something else, you may not have your cursor in front of `and`. If you do not see the word \"delve\" in the popup, the parser is not working. See step 1. \n\n### Check the CSS styling is working\nOn some machines, you can edit the colors in the styles.less file ( in Atom ) and the colors change immediately. However, I'm not convinced that always works. If the colors change in the delve file when you change them in the styles.less, then your style selection is working. \n\nIf the colors do not change, or if there are no colors for left-hand-side variables ```def sales_event_type[salesevent]``` <- In this piece of code, if everything is working the ```def``` should be blue and the ```salesevent``` should be green. \n\nWays to troubleshoot this are to a) check that the contents of styles.less from this package are saved in the Atom global styesheet ( see step 3 ) or b) restart Atom after you save the contents into the stylesheet. \n\nIf parsing is working correctly, but the styling is not, you may still see some highlighting. This is because Atom has some generic CSS defined for certain keywords that overlap with some of the output from this package.\n\n---\n\n## Broken?\n\nAtom autoupdated and now I see an error when I open Atom that says something about and npm or NODE_MODULE_VERSION mismatch\n    In this case, I found the following to fix it\n      1) Go to your package directory ~/.atom/packages/delve-language and try ```npm rebuild --update-binary & npm install``` **\n      2) Also do ```apm rebuild --update-binary & apm install```.\n      \n      ** I needed to do ```export CC=clang & export CXX=clang++``` to get npm rebuild to run without errors.\n___\n\n## Background\n\n\nYou don't need to do these steps -> unless we need to debug the npm parser. This may happen if we change the grammar and need to update the parser.\n\nWe have a raidelve parser - npm package called ```tree-sitter-delve-language```\nthis should be installable via npm on the command line\n\n```npm install -g tree-sitter-delve-language```\n\nThis repo needs to be installed into Atom ( run from this directory)\n```apm install``` or ``` apm install https://github.com/sjbertolani/atom-language-delve```\n\nThen open any file ending in .delve that has code in it.\n\n---\n\nstyle.less - how we select and color different items. This needs to be added to your styles.less. Ideally, this should get imported as part of the package but I can't figure out how to do that. \n\npackage.json - where we specify the dependencies ( including the npm package)\n\ngrammars/tree-sitter-delve.cson - where you define the css selectors to highlight different aspects of the code\n\n---\n\nResources\n\nTree Sitter grammar spec for delve\nhttps://github.com/RelationalAI/raicode/blob/master/deps/src/parser/delve.js\n\nHow to add a new grammer to Atom using the Tree Sitter syntax\nhttps://flight-manual.atom.io/hacking-atom/sections/creating-a-grammar/\n\nA walkthrough that shows how to add a grammer to Atom\nhttps://gist.github.com/Aerijo/df27228d70c633e088b0591b8857eeef\n\nCreate Syntax Highlighting Package\nhttps://www.sitepoint.com/how-to-write-a-syntax-highlighting-package-for-atom/\n\nhttps://stackoverflow.com/questions/38928523/in-an-atom-package-how-do-i-style-patterns-in-a-grammar\n\nhttps://acarril.github.io/posts/atom-latex\n\n---\n\nYou might need ```npm install -g node-gyp```\n\n---\n\nAdditional Notes:\n\n- You can test if the parser is working by placing your cursor before something in the code and running the Log Cursor Scope command ( on a mac this is Command + Option + P ). For example, doing this in front of the keyword ```and``` should result in a pop up that says \"delve\" \"keyword.control\". If you see this, the parser is correctly parsing delve.\n\n- These scopes are how we setup the css selectors. In the styles.less you can see how the scopes ( like delve and keyword.control) get mapped from the lefthand side to the right hand side ( css ) selectors.\n\n- In some documentation, you may see something about using patterns to make selections ( in grammar/tree-sitter-delve.cson ). But, because we are using a tree-sitter parser.... you have to wrap this into the scope hierarchy. \n",
  "metadata": {
    "name": "language-raidelve",
    "main": "./lib/language-raidelve",
    "version": "0.6.0",
    "description": "Language support for RaiDelve from RelationalAI",
    "keywords": [],
    "activationCommands": {
      "atom-workspace": "language-raidelve:toggle"
    },
    "repository": "https://github.com/sjbertolani/atom-language-raidelve",
    "license": "MIT",
    "engines": {
      "atom": ">=1.0.0 <2.0.0"
    },
    "dependencies": {
      "tree-sitter-delve-language": "0.0.1"
    }
  }
}